th = [
    "<th>学历等级</th>",
    "<th>专业名称</th>",
    "<th>职位名称</th>",
    "<th>招聘人数</th>",
]
td = [
    "<td>研究生专业</td>",
    "<td>基础医学</td>",
    "<td>其他人员</td>",
    "<td></td>",
    "<td>研究生专业</td>",
    "<td>临床医学</td>",
    "<td>其他人员</td>",
    "<td></td>",
    "<td>研究生专业</td>",
    "<td>临床医学</td>",
    "<td>其他人员</td>",
    "<td></td>",
    "<td>研究生专业</td>",
    "<td>药学</td>",
    "<td>其他人员</td>",
    "<td></td>",
    "<td>研究生 专业</td>",
    "<td>护理</td>",
    "<td>其他人员</td>",
    "<td></td>",
]
import numpy as np

td = np.reshape(td, (-1, len(th)))


["方向", "序号", "岗位", "实习城市", "专业"]
[
    [
        "研发技术",
        "1",
        "声学研发岗",
        "潍坊、青岛",
        "声学、水声工程、海洋技术、物理学及相关专业",
    ],
    [
        "2",
        "硬件研发岗",
        "青岛",
        "电子科学与技术、信息与通信工程、电 气工程、控制科学与工程、计算机科学与技术、电磁场与无线技术",
    ],
    ["3", "结构研发岗", "青岛", "机械工程、自动化、声学、电子信息"],
    [
        "4",
        "软件研发岗",
        "潍坊、青岛",
        "软件工程、计算机科学与技术、人工智能、大数据、电子信息工程、电子信息科学与技术、通信工程",
    ],
    [
        "5",
        "应用设计与开发岗",
        "潍坊",
        "软件工程、计算机科学与技术 、数据科学与大数据技术、信息安全",
    ],
    ["6", "机械开发岗", "潍坊", "机械工程、自动化、电气工程"],
    [
        "7",
        "射频研发岗",
        "青岛",
        "电子信息工程、通信工程、电磁场与无线技术、微波工程/射频工程",
    ],
    [
        "8",
        "算法研发岗",
        "潍坊",
        "软件工程、计算机科学与技术、控制科学与工程、数学、力学",
    ],
    [
        "9",
        "天线研发岗",
        "青岛",
        "电子信息工程 、通信工程、电磁场与无线技术、微波工程/射频工程",
    ],
    [
        "10",
        "电气开发岗",
        "潍坊",
        "电气工程及其自动化、电子信息工程、电力电子与电力传动、自动化",
    ],
    [
        "11",
        "检测 开发岗（软件、硬件、光学）",
        "潍坊",
        "软件工程、计算机科学与技术、电子信息工程、通信工程、光学工程",
    ],
    [
        "12",
        "机器视觉开发岗",
        "潍坊",
        "计算机科学与技术、机械工程、自动化、光学工程、控制科学与工程、电子信息工程",
    ],
    [
        "13",
        "马达设计岗",
        "潍坊",
        "电机与电器、电气工程及其自动化、机械电子工程、电力电子与电力传动",
    ],
    ["14", "项目管理岗", "潍坊、青岛", "工科、企业管理、国际经济与贸易、英语、日语"],
    [
        "制造技术",
        "15",
        "工艺开发岗",
        "潍坊",
        "材料学、电子封装、电气工程、信息工程、机械工程",
    ],
    ["16", "品质管理岗", "潍坊、青岛、深圳", "工科"],
    ["17", "模具设计岗", "潍坊", "机械工程、材料成型及控制工程"],
    ["18", "生产技术岗", "潍坊", "机械工程、自动化、材料成型及控制工程"],
    ["19", "工装设计与制造岗", "潍坊", "机械工程、材料成型及控制工程"],
    ["20", "组装工艺岗", "潍坊", "机械工程、自动化、电子信息、物理学"],
    ["21", "产品分析改善岗", "潍坊", "工科"],
    ["22", "精益工程岗", "潍坊", "工业工程"],
    ["23", "生产设备岗", "潍坊", "机械工程、自动化"],
    ["职能", "24", "人力资源岗", "潍坊", "工商管理、心理学"],
]
